<?php

use Illuminate\Database\Seeder;

class AddressesTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $addr_do = ["11111" => '서울특별시', "11112" => '인천광역시', "11113" => '부산광역시', "11114" => '대구광역시',
                    "11121" => '대전광역시', "11122" => '광주광역시', "11123" => '울산광역시', "11124" => '제주도',
                    "11131" => '경기도 수원시', "11132" => '경기도 성남시', "11133" => '경기도 안양시', "11134" => '경기도 용인시',
                    "11141" => '경상도 창원시', "11142" => '경상도 김천시', "11143" => '경상도 구미시', "11144" => '경상도 통영시',
                    "11151" => '충청도 청주시', "11152" => '충청도 충주시', "11153" => '충청도 제천시', "11154" => '충청도 영동군',
                    "11161" => '강원도 춘천시', "11162" => '강원도 원주시', "11163" => '강원도 강릉시', "11164" => '강원도 홍천군',
        ];    

        for($i=1; $i<=6; $i++){
            for($j=1; $j<5; $j++){
                DB::table('addresses')->insert([
                    'zip_code' => "111".$i.$j,
                    'addr_1' => $addr_do["111".$i.$j],
                    'addr_2' => "영진 $i - $j",
                    'created_at' => now(),
                ]);
            }
        }
    }
}